SS-api/app/controllers/products_controller.rb

  def create
    @product = Product.create!(product_params)
---
INSERT INTO "products" ("product_type", "status", "available", "published", "available_since", "published_since", "name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @product.update(product_params)
---
UPDATE "products" SET "product_type" = $1, "status" = $2, "name" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["product_type", 0], ["status", 0], ["name", "a updated product"], ["updated_at", "2017-06-11 09:22:47.705077"], ["id", 113]]